Revit 2027 API
ZoneEquipmentData.EquipmentBehavior Property
 The behavior of how zone equipment is allocated with assigned spaces.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoneEquipmentBehavior EquipmentBehavior { get; set; }
Public Property EquipmentBehavior As ZoneEquipmentBehavior
	Get
	Set
public:
property ZoneEquipmentBehavior EquipmentBehavior {
	ZoneEquipmentBehavior get ();
	void set (ZoneEquipmentBehavior value);
}
member EquipmentBehavior : ZoneEquipmentBehavior with get, set
Property Value
ZoneEquipmentBehavior
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace